src/main/java/ok/dht/test/kosnitskiy/result/stage5/WRK_PUT
wrk -d 20s -t 4 -c 64 -R 2000 -s put-different.lua --latency "http://localhost:19230"
Running 20s test @ http://localhost:19230
  4 threads and 64 connections
  Thread calibration: mean lat.: 749.221ms, rate sampling interval: 2848ms
  Thread calibration: mean lat.: 679.942ms, rate sampling interval: 2633ms
  Thread calibration: mean lat.: 853.913ms, rate sampling interval: 2940ms
  Thread calibration: mean lat.: 752.577ms, rate sampling interval: 2779ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.88ms   12.10ms 119.74ms   90.11%
    Req/Sec   390.33     46.84   469.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.01ms
 75.000%    9.06ms
 90.000%   19.90ms
 99.000%   63.36ms
 99.900%   98.88ms
 99.990%  113.34ms
 99.999%  119.81ms
100.000%  119.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.314     0.000000            1         1.00
       1.008     0.100000         1550         1.11
       1.326     0.200000         3102         1.25
       1.616     0.300000         4652         1.43
       2.075     0.400000         6202         1.67
       3.011     0.500000         7751         2.00
       3.715     0.550000         8525         2.22
       4.683     0.600000         9300         2.50
       5.827     0.650000        10074         2.86
       7.211     0.700000        10849         3.33
       9.055     0.750000        11624         4.00
      10.343     0.775000        12011         4.44
      11.535     0.800000        12401         5.00
      13.071     0.825000        12786         5.71
      14.975     0.850000        13173         6.67
      17.247     0.875000        13561         8.00
      18.447     0.887500        13755         8.89
      19.903     0.900000        13949        10.00
      21.759     0.912500        14142        11.43
      23.903     0.925000        14335        13.33
      26.623     0.937500        14529        16.00
      28.367     0.943750        14626        17.78
      30.543     0.950000        14723        20.00
      33.215     0.956250        14820        22.86
      36.351     0.962500        14916        26.67
      40.159     0.968750        15014        32.00
      41.983     0.971875        15062        35.56
      44.063     0.975000        15110        40.00
      47.071     0.978125        15159        45.71
      49.887     0.981250        15207        53.33
      53.599     0.984375        15255        64.00
      56.255     0.985938        15280        71.11
      58.175     0.987500        15304        80.00
      60.735     0.989062        15329        91.43
      65.183     0.990625        15352       106.67
      67.519     0.992188        15376       128.00
      69.951     0.992969        15389       142.22
      71.551     0.993750        15401       160.00
      74.751     0.994531        15413       182.86
      76.799     0.995313        15425       213.33
      79.359     0.996094        15437       256.00
      82.687     0.996484        15443       284.44
      83.967     0.996875        15449       320.00
      86.783     0.997266        15455       365.71
      90.047     0.997656        15461       426.67
      91.391     0.998047        15467       512.00
      94.911     0.998242        15470       568.89
      96.191     0.998437        15474       640.00
      96.447     0.998633        15476       731.43
      97.407     0.998828        15479       853.33
      98.879     0.999023        15482      1024.00
      99.519     0.999121        15484      1137.78
     100.991     0.999219        15485      1280.00
     102.463     0.999316        15487      1462.86
     102.655     0.999414        15489      1706.67
     102.975     0.999512        15490      2048.00
     103.807     0.999561        15491      2275.56
     103.807     0.999609        15491      2560.00
     104.575     0.999658        15492      2925.71
     106.623     0.999707        15493      3413.33
     106.943     0.999756        15494      4096.00
     106.943     0.999780        15494      4551.11
     106.943     0.999805        15494      5120.00
     113.343     0.999829        15495      5851.43
     113.343     0.999854        15495      6826.67
     119.359     0.999878        15496      8192.00
     119.359     0.999890        15496      9102.22
     119.359     0.999902        15496     10240.00
     119.359     0.999915        15496     11702.86
     119.359     0.999927        15496     13653.33
     119.807     0.999939        15497     16384.00
     119.807     1.000000        15497          inf
#[Mean    =        7.881, StdDeviation   =       12.101]
#[Max     =      119.744, Total count    =        15497]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  31805 requests in 20.00s, 2.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 98
  Non-2xx or 3xx responses: 148
Requests/sec:   1590.39
Transfer/sec:    104.13KB
◆ utils git:(stage5) ✗ ❯❯❯ wrk -d 20s -t 4 -c 64 -R 2500 -s put-different.lua --latency "http://localhost:19230"
Running 20s test @ http://localhost:19230
  4 threads and 64 connections
  Thread calibration: mean lat.: 7.354ms, rate sampling interval: 32ms
  Thread calibration: mean lat.: 6.966ms, rate sampling interval: 30ms
  Thread calibration: mean lat.: 7.515ms, rate sampling interval: 34ms
  Thread calibration: mean lat.: 7.400ms, rate sampling interval: 33ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.58ms   12.82ms  98.75ms   87.55%
    Req/Sec   636.60    213.31     1.50k    75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.72ms
 75.000%   12.98ms
 90.000%   27.06ms
 99.000%   62.17ms
 99.900%   79.55ms
 99.990%   86.33ms
 99.999%   98.82ms
100.000%   98.82ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.341     0.000000            1         1.00
       1.495     0.100000         2479         1.11
       2.107     0.200000         4959         1.25
       2.881     0.300000         7440         1.43
       4.077     0.400000         9913         1.67
       5.715     0.500000        12393         2.00
       6.667     0.550000        13636         2.22
       7.847     0.600000        14872         2.50
       9.223     0.650000        16114         2.86
      10.831     0.700000        17349         3.33
      12.983     0.750000        18588         4.00
      14.231     0.775000        19207         4.44
      15.807     0.800000        19825         5.00
      17.839     0.825000        20449         5.71
      20.191     0.850000        21065         6.67
      23.375     0.875000        21688         8.00
      25.055     0.887500        21994         8.89
      27.055     0.900000        22303        10.00
      29.375     0.912500        22616        11.43
      32.031     0.925000        22926        13.33
      34.975     0.937500        23233        16.00
      36.767     0.943750        23388        17.78
      38.783     0.950000        23543        20.00
      40.831     0.956250        23698        22.86
      43.711     0.962500        23852        26.67
      46.303     0.968750        24007        32.00
      48.063     0.971875        24086        35.56
      49.983     0.975000        24162        40.00
      51.903     0.978125        24239        45.71
      54.687     0.981250        24317        53.33
      57.343     0.984375        24395        64.00
      58.751     0.985938        24434        71.11
      59.711     0.987500        24473        80.00
      61.183     0.989062        24510        91.43
      62.879     0.990625        24549       106.67
      65.119     0.992188        24588       128.00
      66.239     0.992969        24607       142.22
      67.647     0.993750        24627       160.00
      68.927     0.994531        24647       182.86
      69.887     0.995313        24665       213.33
      71.359     0.996094        24687       256.00
      72.127     0.996484        24695       284.44
      73.087     0.996875        24704       320.00
      74.175     0.997266        24715       365.71
      75.135     0.997656        24724       426.67
      75.775     0.998047        24733       512.00
      76.223     0.998242        24738       568.89
      76.799     0.998437        24743       640.00
      77.951     0.998633        24748       731.43
      78.847     0.998828        24752       853.33
      79.551     0.999023        24757      1024.00
      80.127     0.999121        24760      1137.78
      80.383     0.999219        24762      1280.00
      80.895     0.999316        24766      1462.86
      81.023     0.999414        24768      1706.67
      81.663     0.999512        24769      2048.00
      82.943     0.999561        24771      2275.56
      83.839     0.999609        24772      2560.00
      84.607     0.999658        24773      2925.71
      85.311     0.999707        24775      3413.33
      85.311     0.999756        24775      4096.00
      85.567     0.999780        24776      4551.11
      85.951     0.999805        24777      5120.00
      85.951     0.999829        24777      5851.43
      86.271     0.999854        24778      6826.67
      86.271     0.999878        24778      8192.00
      86.335     0.999890        24779      9102.22
      86.335     0.999902        24779     10240.00
      86.335     0.999915        24779     11702.86
      89.023     0.999927        24780     13653.33
      89.023     0.999939        24780     16384.00
      89.023     0.999945        24780     18204.44
      89.023     0.999951        24780     20480.00
      89.023     0.999957        24780     23405.71
      98.815     0.999963        24781     27306.67
      98.815     1.000000        24781          inf
#[Mean    =       10.579, StdDeviation   =       12.823]
#[Max     =       98.752, Total count    =        24781]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  49920 requests in 20.01s, 3.19MB read
Requests/sec:   2495.35
Transfer/sec:    163.27KB